- In pandas we can join two dataframes

- merge

- join

- concat

In [ ]:
# merge

- It is under the pandas under the function pd.merge

- It is similar to SQL joins

- You can join with specific columns

In [ ]:
import pandas as pd

In [11]:
import pandas as pd
d1 = {'ID' : [1,2,3],
     'Name': ['Chandu', 'Pawan', 'Bansal']}
d2 = {'ID' : [1,2,4],
     'Age': [20,25,30]}

df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [9]:
df1

   ID    Name
0   1  Chandu
1   2   Pawan
2   3  Bansal

In [8]:
df2

   ID  Age
0   1   20
1   2   25
2   4   30

In [13]:
pd.merge(df1,df2, on = 'ID', how = 'inner')

   ID    Name  Age
0   1  Chandu   20
1   2   Pawan   25

In [14]:
pd.merge(df1,df2, on = 'ID', how = 'outer')

   ID    Name   Age
0   1  Chandu  20.0
1   2   Pawan  25.0
2   3  Bansal   NaN
3   4     NaN  30.0

In [15]:
pd.merge(df1,df2, on = 'ID', how = 'left')

   ID    Name   Age
0   1  Chandu  20.0
1   2   Pawan  25.0
2   3  Bansal   NaN

In [16]:
pd.merge(df1,df2, on = 'ID', how = 'right')

   ID    Name  Age
0   1  Chandu   20
1   2   Pawan   25
2   4     NaN   30

## homework

df1.join(df2)

df1.concat([df1,df2])

In [ ]:
# Transformations

In [ ]:
# Steps in EDA

1. Read the Data

2.